[{"content":"WILL OLD-FASHIONED, OBJECTIVE JOURNALISM COME BACK?\n\n    In this era when newspapers and television are overrun with people expressing opinions instead of news, forgive me for being nostalgic about the good old days when I grew up in print journalism. \n\n    We were told that every story had more than one side and our job was to get all sides into our story. That was defined by the editors and, later, in tv, by producers. \n\n    It was more than 'he said, she said' accounts of news. It involved a sincere effort to get the very flavor of a story into what you wrote or presented. Lamentably, the world has changed. We have evolved---or devolved---into a business where the facts are far less important than opinions. \n\n    A generation is growing up without any knowledge of  what “objective journalism” means. Not that it was ever simple to define. How important is it to present the facts with a heavy dose of information to the reader or viewer on the sources of those facts? Is it important to encourage that person to learn to be skeptical of both the people involved in the story and the reporter presenting  it? For objective journalism requires that the person receiving the information look it over carefully and analytically too.\n\n     Objectivity is difficult to achieve. Columnist David Brooks has written that that first stage of getting to objectivity is “the ability to look at all the facts, whether they make you feel good or not.”  He added that “journalists have to suppress their egos so that they can see the whole truth, whether they like it or not.”\n\n      What a contrast that is to what we see in journalism today! Much of the presentation of alleged facts is often based on what the reporter’s own prejudices are, There is a din of blah-blah-blah cluttering the air waves. And even respectable newspapers that have long set standards for objectivity have copped out on that time-honored role. \n\n        Whatever the reason---economics, competitive zeal or an ambition to achieve notoriety---the old ethical standards are, to a large extent, in danger of collapse.   They are being watered down by the new imperative of journalism, putting opinionating ahead of the old search for the truth. That quest was never easy but at least trying to get there was a good part of the job. \n\n        Then there is the phenomenon I would describe as consorting with the other side---or incest. I have in mind an event  like the White House correspondents, dinner,  where reporters get together to shmooze with the very people they are supposed to be scrutinizing.\n\n       I cannot believe that old-fashioned journalism is going or gone. It’s needed more than ever. And we can hope that, in the democratic tradition of America, it will come back.","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1258761810838998","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.2421","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25-5","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"parent"}],"id":"IAB25-5","label":"Hate Content"},{"score":"0.0881","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"self"}],"id":"IAB25","label":"Non-Standard Content"}]},"postidString":"facebook_page.219296474785542_1258761810838998","postMeta":{"inserted":"content-engine"},"timestamp":1493737922,"sharesRcvd":5,"likesRcvd":22,"source":"facebook_page","lastUpdateQuantum":4986975,"name":"Gabe Pressman","repliesRcvd":4,"username":"GabePressmanNBC","timeQuantum":4979126,"type":"status"},{"content":"MAY 4TH, 1970, THE SHOOTING OF STUDENTS AT KENT STATE\n\nIn the 1960s and early 1970s. New York City was seething.\n\nStudents protesting the Vietnam War and the shooting of student demonstrators at Kent State in Ohio marched on Broadway and college campuses throughout the city. \n\nI remember 1969 when, in observance of Vietnam Moratorium Day, Mayor John Lindsay ordered the American flag lowered over City Hall. I saw Matthew Troy, a flamboyant City Councilman from Queens, run up to the root and raise the flag to full staff. The gesture by Troy resonated in the streets of the city. \n\nNew York was deeply divided. On one day, responding to liberal student protesters, thousands of hard hats, construction workers, marched up Broadway to City Hall. These pro-Vietnam War, set-styled patriots, stormed up the steps, shouting epithets about Lindsay, the liberal, anti-Vietnam War mayor. I saw windows being broken but no serious injuries or fatalities resulted. \n\nThe angry demonstration by the hard hats....and the student protests across the city on several campuses---were typical of what was happening in cities throughout the nation. I saw student demonstrators set a building afire at City College. The police, many of whom were sympathetic to the hard hats, did not intervene.\n\nMay 4, 1970 had been a bloody day in Ohio. Members of the National Guard fired into a crowd of Kent State University students, killing four and wounding nine. That incident had stirred the anger and violence in New York and throughout the nation.\n\nLindsay, Matty Troy and the people involved in the New York unrest long ago passed from the scene. But they can remind us of an emotional time when New York and the nation teetered on the edge of great violence. \n\nAnd the Kent State shooting---critics called it a massacre----showed us it can happen here.","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1261252097256636","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.2532","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25-5","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"parent"}],"id":"IAB25-5","label":"Hate Content"},{"score":"0.1116","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"self"}],"id":"IAB25","label":"Non-Standard Content"}]},"postidString":"facebook_page.219296474785542_1261252097256636","postMeta":{"inserted":"content-engine"},"timestamp":1493920017,"sharesRcvd":2,"likesRcvd":9,"source":"facebook_page","lastUpdateQuantum":4979982,"name":"Gabe Pressman","repliesRcvd":1,"username":"GabePressmanNBC","timeQuantum":4979733,"type":"status"},{"content":"RECALLING THE DAY THE WAR ENDED IN EUROPE\n\nOn May 8th, 1945, the war ended in Europe---and the world went wild. At least those nations that were on our side.\n\nThe American troops in Europe, the English and French celebrated----and so did millions of Americans at home.\n\nBut the story was somewhat different for those of us in the armed forces in the Pacific. I remember how, on my little ship, we were happy about the surrender of Germany and the suicide of Adolph Hitler. But, as we heard on the radio about the joyous celebrations in America, many members of our crew on the USS PC 470. wondered: “What about us? Don’t they know there’s a war on here??”\n\nIndeed, the fleet we were part of was preparing for an assault on the home islands of Japan. And our battle plan anticipated that there would be one million American casualties. Hardly an easy figure to digest!\n\nThis was three months before the atomic bombs were dropped and the Japanese emperor sued for peace. So we were expecting a tough and bloody fight against the fiercely determined Japanese Army and Navy.\n\nIn Europe, on May 8th, German troops gave up their arms to the Allies. The Germans didn’t surrender to the Russians until May 9th. In America, President Harry Truman proclaimed that May 13th, Mother’s Day, would be a day of Thanksgiving. “Our rejoicing is sobered and subdued,” he said, “by a supreme consciousness of the terrible price we have paid to rid the world of Hitler and his evil band.”\n\nIn England, Prime Minister Winston Churchill, appeared on a flag-draped balcony in London and told a cheering crowd: “God bless you all!” And the people sang: “For he’s a jolly good fellow!”\n\nIn New York, a cheering crowd overflowed Times Square. The city’s skyscrapers showered down the heaviest deluge of ticker tape and other assorted debris since the American hero Charles Lindbergh, was hailed in a parade up lower Broadway in 1927.\n\nThousands couldn’t stop celebrating. In the garment district, they hurled thousands of bolts of cloth into the streets along with phone books . They danced. They sang. And many cried: “It’s over! It’s over!”\n\nOne soldier, it’s reported, cried out: “What are they hollerin’ about? It ain’t over!”\n\nFiorello LaGuardia, the feisty mayor of the city, scolded the celebrants in a broadcast over loudspeakers. He ordered them to go back to work.\n\nIt dawned on some people that the war wasn’t over, that tough, dangerous times still lay ahead. But, although the boys and girls in the Pacific might not agree, it was indeed a time to celebrate.","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1265384516843394","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.4100","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25-5","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"parent"}],"id":"IAB25-5","label":"Hate Content"},{"score":"0.1107","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"self"}],"id":"IAB25","label":"Non-Standard Content"},{"score":"0.1104","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB20","rel":"self"}],"id":"IAB20","label":"Travel"},{"score":"0.0983","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB20-14","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB20","rel":"parent"}],"id":"IAB20-14","label":"Europe"}]},"postidString":"facebook_page.219296474785542_1265384516843394","postMeta":{"inserted":"content-engine"},"timestamp":1494254123,"sharesRcvd":3,"likesRcvd":13,"source":"facebook_page","lastUpdateQuantum":4981134,"name":"Gabe Pressman","imageLarge":"https://scontent.xx.fbcdn.net/v/t1.0-9/s720x720/18301693_1265384516843394_2420756210848507288_n.jpg?oh=b5987a1ccaa251af680cb06dcd832f79&oe=59B7709A","objectID":"1265384516843394","repliesRcvd":0,"image":"https://scontent.xx.fbcdn.net/v/t1.0-0/s130x130/18301693_1265384516843394_2420756210848507288_n.jpg?oh=19fc09d547e32cbaf099f33ce350f3da&oe=59C08B8F","username":"GabePressmanNBC","link":"https://www.facebook.com/GabePressmanNBC/photos/a.893019720746544.1073741827.219296474785542/1265384516843394/?type=3","timeQuantum":4980847,"title":"Timeline Photos","type":"photo"},{"content":"GEORGE POLK---A REPORTER WHO DIED SEARCHING FOR TRUTH\n\nGeorge Polk was a courageous young reporter who was murdered in Greece just 69 years ago. He was trying to cover the Greek civil war, a battle between Greek government forces and Communist insurgents.\n\nHis body was found in Salonika Bay in northern Greece on May 16, 1948. Polk, a protege of Edward R. Murrow, was regarded as a hero by the journalists of that day---and indeed, in his name, Long Island University still gives awards each year to enterprising reporters.\n\nThe news of Polk's death stunned the journalistic community of that era. Polk was an appealing figure. He was just 34 years old. He has covered stories in China and Europe. He enlisted in the Navy after Pearl Harbor and flew combat missions in the Solomon Islands. He was a reporter who often resisted government, or official, sources of news, when he suspected there was an effort to cover up the facts. His search for truth was apparently what killed him.\n\nKati Marton, in her book \"The Polk Conspiracy\" claimed that the Greek government at that time assassinated Polk because he was digging into a rightist conspiracy that included hiding funds for the personal use of a Greek politician in a New York bank account. Time has obscured the details of Polk's quest for truth---but his memory lives on.\n\nSo long as journalists pursue the truth George Polk's name will stand out. He was young, impetuous, strong-willed. But, above all, he will be remembered for his courage.","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1269010916480754","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.3106","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25-5","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"parent"}],"id":"IAB25-5","label":"Hate Content"},{"score":"0.3030","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB11-5","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB11","rel":"parent"}],"id":"IAB11-5","label":"Commentary"},{"score":"0.0802","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB11","rel":"self"}],"id":"IAB11","label":"Law, Gov’t & Politics"},{"score":"0.0697","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"self"}],"id":"IAB25","label":"Non-Standard Content"}]},"postidString":"facebook_page.219296474785542_1269010916480754","postMeta":{"inserted":"content-engine"},"timestamp":1494608799,"sharesRcvd":2,"likesRcvd":6,"source":"facebook_page","lastUpdateQuantum":4986975,"name":"Gabe Pressman","imageLarge":"https://scontent.xx.fbcdn.net/v/t1.0-9/18447448_1269010916480754_6105257757132646651_n.jpg?oh=9876e155d65715d2467ae409a54b20c0&oe=59751747","objectID":"1269010916480754","repliesRcvd":0,"image":"https://scontent.xx.fbcdn.net/v/t1.0-0/s130x130/18447448_1269010916480754_6105257757132646651_n.jpg?oh=4bcac4afce324a626fe7cba1e3758735&oe=59B7CB2C","username":"GabePressmanNBC","link":"https://www.facebook.com/GabePressmanNBC/photos/a.893019720746544.1073741827.219296474785542/1269010916480754/?type=3","timeQuantum":4982029,"title":"Timeline Photos","type":"photo"},{"content":"THE 17TH OF MAY DAY---NORWEGIANS’ 4TH OF JULY \n\nTo Norwegians----it’s their Fourth of July…..\n\nThey call it 17th of May day---and they have been celebrating it since 1814. It marks the day when Norway won its independence and established its constitution. Inspired by America’s constitution, this document is the second oldest democratic constitution in the world. \n\nI have a special feeling towards this day. For my wife, Vera, an immigrant from Norway, and I used to celebrate it right here in Brooklyn. \n\nA thriving Norwegian-American community existed in Bay Ridge for decades. And our son, Michael, from the time he was four years old, helped us celebrate the 17th of May Day for many years. We would go to Bay Ridge to see the parade, which went down Third Avenue and Bay Ridge Avenue and Fifth Avenue to 67th Street, where the reviewing stand was set up for the parade.\n\nIt was a colorful parade with people attired in Norwegian costumes dating back to the 19th century. The women wore beautiful bunas, dresses adorned with embroidery, in many colors, each representing a different section of Norway. \n\nMichael waved little American and Norwegian flags. Both flags carry the colors red, white and blue. And, indeed, the framers of the Norwegian constitution modeled it after our own constitution. It has imbued Norway with a spirit --- they call it the spirit of the 17th of May---that is devoted to freedom and democracy. It inspired Norway to resist the Nazi German invasion in World War II, with determined underground fighters battling the invaders and, in many cases, sacrificing their lives.\n\nThe Bay Ridge celebration, which aims to encourage “a deep appreciation of the ideals of independence and freedom,” is a festive occasion. It is associated with spring and the coming of summer---a most significant day in a country coming out of a frigid winter.\n\nIn Norway, there are parades. The children have a starring role. Hot dogs, soda and ice cream are on the menu. Near the sea and rivers, eating salmon and trout is part of the celebration. In New York, over the years, Norwegian-Americans have celebrated with Viking helmets, cowboy hats and home-made costumes.\n\nThis year the holiday will be celebrated on the nearest Sunday to the 17 of May, the 21st, in Bay Ridge, and it will feature a parade starting at 80th Street and Third Avenue.\n\nProbably the emotions Norwegians and their relatives here experience on May 17th is best expressed in Norway’s national anthem: “Ja, vi elsker dette landet….” In English, the words begin: \n\n“Yes, we love this country\n\nAs it rises forth,\n\nRugged, weathered, above the sea, \n\nWith the thousands of homes\n\nLove, love it and think of our father and mother \n\nAnd the saga night that sends\n\nDreams to our earth….”","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1271722319542947","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.3077","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB18-6","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB18","rel":"parent"}],"id":"IAB18-6","label":"Accessories"},{"score":"0.2569","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14-7","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14","rel":"parent"}],"id":"IAB14-7","label":"Weddings"},{"score":"0.1218","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB8-11","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB8","rel":"parent"}],"id":"IAB8-11","label":"French Cuisine"},{"score":"0.0883","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB20-12","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB20","rel":"parent"}],"id":"IAB20-12","label":"Cruises"},{"score":"0.0702","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB8","rel":"self"}],"id":"IAB8","label":"Food & Drink"},{"score":"0.0692","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB20","rel":"self"}],"id":"IAB20","label":"Travel"},{"score":"0.0688","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB18","rel":"self"}],"id":"IAB18","label":"Style & Fashion"},{"score":"0.0575","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14","rel":"self"}],"id":"IAB14","label":"Society"}]},"postidString":"facebook_page.219296474785542_1271722319542947","postMeta":{"inserted":"content-engine"},"timestamp":1494889559,"sharesRcvd":1,"likesRcvd":11,"source":"facebook_page","lastUpdateQuantum":4986975,"name":"Gabe Pressman","imageLarge":"https://scontent.xx.fbcdn.net/v/t1.0-9/18527760_1271722319542947_2404305826603502319_n.jpg?oh=a05eac9646b5c9ca35012b48387a3b42&oe=59BE8A12","objectID":"1271722319542947","repliesRcvd":0,"image":"https://scontent.xx.fbcdn.net/v/t1.0-0/s130x130/18527760_1271722319542947_2404305826603502319_n.jpg?oh=6aa4df0d65b1eef3bfa2f94c7acfb75a&oe=59B36579","username":"GabePressmanNBC","link":"https://www.facebook.com/GabePressmanNBC/photos/a.893019720746544.1073741827.219296474785542/1271722319542947/?type=3","timeQuantum":4982965,"title":"Timeline Photos","type":"photo"}]