[{"content":"MARILYN MONROE---THE TRAGEDY OF HER LIFE\n\n \n      She was effervescent. She was beautiful and she transfixed the reporters who interviewed her one day in New York. I was one of them.\n       I remember the main topic of the conversation. It was her new boyfriend who later became her husband, playwright Arthur Miller. \n        Marilyn was in a good mood. She laughed and she made us laugh. I asked her: “What do you see in this guy?” And she trilled in a dreamy, soft voice: “Have you seen him?” She rolled out the seen word in a mischievous way. \n          And she made us all laugh. She was charming and made us all part of the fun.\n           Marilyn was born on June 1, 1926 in Los Angeles. Her name was Norma Jeane Baker. She was a product of a disturbed home. Both her mother and her maternal grandparents were committed to mental institutions and she was brought up by foster families. \n            Discovered by a photographer while working in a munitions factory, she had a successful modeling career.\nLater, she dyed her brown hair blonde and changed her name to Marilyn Monroe, launching a film career that brought her international fame. She married baseball star Joe DiMaggio. But that marriage ended in divorce nine months later.  The marriage to Arthur Miller dissolved in four years. \n         She died at her home in Brentwood, California after taking an overdose of barbiturates. She was 36. \n          Director Lawrence Schiller said: “There were two Marilyns that I met. Marilyn in 1960 was like fresh dew on the lawn when you get up the morning. She wasn’t the stupid dumb blond we saw in the movies. You could really see her humor and wit.”\n      But, in the final months, Schiller believed, Marilyn didn’t know “where she was in her life. She was fighting to stay alive. She couldn’t get to work on time. She was taking more of a toll on other people and the studio. She had no perspective.\n     “She had no idea what was going on really---no idea at all.”","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1292391454142700","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.2374","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14-7","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14","rel":"parent"}],"id":"IAB14-7","label":"Weddings"},{"score":"0.1189","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14","rel":"self"}],"id":"IAB14","label":"Society"}]},"postidString":"facebook_page.219296474785542_1292391454142700","postMeta":{"inserted":"content-engine"},"timestamp":1496777960,"sharesRcvd":14,"likesRcvd":36,"source":"facebook_page","lastUpdateQuantum":4995759,"name":"Gabe Pressman","imageLarge":"https://scontent.xx.fbcdn.net/v/t1.0-9/s720x720/18951458_1292391454142700_5463457824841622054_n.jpg?oh=519e051afa4d2a829ee9287a4a15cddb&oe=599DC9F2","objectID":"1292391454142700","repliesRcvd":6,"image":"https://scontent.xx.fbcdn.net/v/t1.0-0/s130x130/18951458_1292391454142700_5463457824841622054_n.jpg?oh=06254350c08165ffb62b74ed8e38f549&oe=59E7D8E7","username":"GabePressmanNBC","link":"https://www.facebook.com/GabePressmanNBC/photos/a.893019720746544.1073741827.219296474785542/1292391454142700/?type=3","timeQuantum":4989259,"title":"Timeline Photos","type":"photo"},{"content":"REMEMBERING NATHAN HALE, A PATRIOT AND HERO\n\nBack when I was a cub reporter at City Hall, Willie Collins was the man who ran the news stand on Broadway nearby.\nWillie was a cynic. He was also a source of gossip about the goings on at City Hall.\nThere was a fair amount of corruption then in city government---and Willie was always sure to nail the politicians he blamed for all evil.\nHe would look at the statue of the American hero, Nathan Hale, and say: “He’s the only honest man here. His feet and his arms are tied. So he can’t do any harm.”\nIt was a tasteless thing to say about an icon of our history.\nBut Willie was not an authority on good taste. \nThe fact is that Nathan Hale was born on June 6, 1755, and when General Washington asked for a volunteer for a dangerous mission, Captain Hale stepped up. Posing as a school teacher, he collected information about the British Army in Long Island. But he was captured by the British and hanged as a spy.\nHis immortal words as he stood on the gallows were: “I only regret that I have but one life to give for my country.”\nThe place where Hale was executed has never been clearly established. Historians report variously that it was at what is now 66th Street and Third Avenue, or at the site of the Yale Club in midtown or in what is now City Hall Park, or perhaps further downtown or elsewhere.\nThe statue has been moved around many times over the years. Unfortunately, it now stands facing City Hall at the northern end of City Hall Park. It’s barely visible to New Yorkers passing on the streets nearby.\nYet this Yale graduate and son of a prominent Connecticut family deserves to be honored by the school children of today and tomorrow and by their parents and grandparents.\nCaptain Hale was a patriot. He was 21 years old when he died.","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1293352660713246","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.5198","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB12-3","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB12","rel":"parent"}],"id":"IAB12-3","label":"Local News"},{"score":"0.4997","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB21-1","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB21","rel":"parent"}],"id":"IAB21-1","label":"Apartments"},{"score":"0.3239","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB10-4","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB10","rel":"parent"}],"id":"IAB10-4","label":"Gardening"},{"score":"0.3096","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB6-6","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB6","rel":"parent"}],"id":"IAB6-6","label":"Parenting teens"},{"score":"0.2079","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25-5","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"parent"}],"id":"IAB25-5","label":"Hate Content"},{"score":"0.0923","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB20-22","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB20","rel":"parent"}],"id":"IAB20-22","label":"National Parks"},{"score":"0.0632","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"self"}],"id":"IAB25","label":"Non-Standard Content"},{"score":"0.0578","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB10","rel":"self"}],"id":"IAB10","label":"Home & Garden"},{"score":"0.0558","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB20","rel":"self"}],"id":"IAB20","label":"Travel"},{"score":"0.0555","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB6","rel":"self"}],"id":"IAB6","label":"Family & Parenting"},{"score":"0.0538","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB21","rel":"self"}],"id":"IAB21","label":"Real Estate"},{"score":"0.0525","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB12","rel":"self"}],"id":"IAB12","label":"News"}]},"postidString":"facebook_page.219296474785542_1293352660713246","postMeta":{"inserted":"content-engine"},"timestamp":1496864496,"sharesRcvd":7,"likesRcvd":27,"source":"facebook_page","lastUpdateQuantum":4995759,"name":"Gabe Pressman","imageLarge":"https://scontent.xx.fbcdn.net/v/t1.0-9/18951453_1293352660713246_2784610601237168253_n.jpg?oh=b701ef88179c6a250c5a31626dde9322&oe=59EA5422","objectID":"1293352660713246","repliesRcvd":2,"image":"https://scontent.xx.fbcdn.net/v/t1.0-0/s130x130/18951453_1293352660713246_2784610601237168253_n.jpg?oh=0eaac08854d45193d8796d18369ed3a5&oe=59E0C249","username":"GabePressmanNBC","link":"https://www.facebook.com/GabePressmanNBC/photos/a.893019720746544.1073741827.219296474785542/1293352660713246/?type=3","timeQuantum":4989548,"title":"Timeline Photos","type":"photo"},{"content":"BOBBY KENNEDY, MEMORY OF A NEW YORK SENATOR STRUCK DOWN IN HIS PRIME\n\nIt was 1968, a sad year for all of America, and especially for New York.\n\nAmid the riots in the streets, amid demonstrations against the Vietnam War and for civil rights, and the assassination of Martin Luther King, New York's young, charismatic senator, Bobby Kennedy, was assassinated just five years after his brother, President Jack Kennedy. Bobby was struck down just as he was celebrating his victory in the California presidential primary. He seemed destined for the White House.  \n\nWe thought things couldn't get any worse.\n    \nI knew Bobby Kennedy. Since he came to New York and decided to run for the Senate, as a reporter I had a friendly relationship with him. On weekends, when he came home from Washington, he would often stay at the Carlyle Hotel, one of his family's favorite hangouts.\n\nI remember having a drink with him....and he would often ask me the same question, \"How's Lindsay doing?\" I was stationed at City Hall and followed our mayor day after day. Lindsay, an amazing phenomenon, was a liberal Republican. Commentators, using the same word as they did for young Kennedy, said Lindsay had charisma. Lindsay attracted national attention as he walked the streets in Harlem in shirtsleeves during turbulent times. \n    \nBobby Kennedy, the clever Boston Irish politician, probably was thinking that maybe savvy Republicans would put up Lindsay to run against him. It never happened. Lindsay couldn't get the traction he needed when he finally did make a run for president in 1972. \n\nBut in Bobby Kennedy's invasion of New York, there were some colorful moments. When he decided to run for the Senate here, he was denounced as a carpetbagger. But with his wily, Boston-bred smarts, he managed to win the election handily. \n\nThe most dramatic moment of the campaign came when his opponent, an upstate Republican, Senator Kenneth Keating, bought a half hour of television time and invited Kennedy to debate him. The broadcast was scheduled for 7:30 in the evening and Kennedy appeared just outside the studio five minutes before. He had never accepted the invitation. \n\nBut now he had appeared--and Keating was prepared to \"debate\" an empty chair. Kennedy stood in the hallway outside the studio demanding admission to the studio. But guards kept him out. He made quite a scene and, of course, other reporters and I gobbled it up. \n\nIt was a colorful prelude to the election---and poor Keating, an old-fashioned Republican, never knew what hit him. Bobby Kennedy was elected senator.\n\nKennedy had all the charm of his brother. Once, I remember, he invited me to a dinner at the Carlyle, when he and his wife Ethel were entertaining another couple.\n\nThe Kennedys enjoyed the hurly-burly of politics. And they could laugh at themselves. In those days, Kennedy would often end his speeches with lines loosely borrowed from playwright George Bernard Shaw.\n\nKennedy would say in his speech's final line: \"Some men see things as they are and say why. I dream things that never were and say why not!\"\n\nAt this long ago dinner at the Carlyle, I remember Ethel Kennedy standing up, her wine glass aloft to propose a toast. \"Let's hear it for George Bernard Shaw!\" she exclaimed. And the table exploded in agreement. \n\nThe Kennedys loved politics and they could laugh at themselves. When he was gunned down in California, Bobby Kennedy was 42.","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1295194267195752","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.2387","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25-5","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"parent"}],"id":"IAB25-5","label":"Hate Content"},{"score":"0.0834","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB25","rel":"self"}],"id":"IAB25","label":"Non-Standard Content"}]},"postidString":"facebook_page.219296474785542_1295194267195752","postMeta":{"inserted":"content-engine"},"timestamp":1497037256,"sharesRcvd":19,"likesRcvd":36,"source":"facebook_page","lastUpdateQuantum":4995759,"name":"Gabe Pressman","imageLarge":"https://scontent.xx.fbcdn.net/v/t1.0-9/q85/s720x720/18921948_1295194267195752_7665853629663251848_n.jpg?oh=3e1b6cae1560ad0400e76c39b8f4c472&oe=59A3B36E","objectID":"1295194267195752","repliesRcvd":7,"image":"https://scontent.xx.fbcdn.net/v/t1.0-0/s130x130/18921948_1295194267195752_7665853629663251848_n.jpg?oh=7088a1ae8f5411259dd304d5d7544ab4&oe=59DF05E3","username":"GabePressmanNBC","link":"https://www.facebook.com/GabePressmanNBC/photos/a.893019720746544.1073741827.219296474785542/1295194267195752/?type=3","timeQuantum":4990124,"title":"Timeline Photos","type":"photo"},{"content":"NEW YORK'S FAREWELL TO JUDY GARLAND\n\nJudy Garland, whose songs entranced America for decades, died in London apparently of an accidental overdose of sleeping pills. \n\nHer body was shipped to New York, where the glass-enclosed coffin was taken to the Frank E. Campbell Funeral Home on 81st Street and Madison Avenue.\n\nOn June 26, 1969, people streamed into the building by the thousands, starting before dawn. I remember how tearful some were. There were elderly and young people, priests, housewives, handicapped people and many so-called “hippies” – that's what we called the young folks who rebelled against the social conventions of the day. \n\nI saw many in tears. And, in the funeral home, there was the heavy scent of flowers from many people, including Fred Astaire, James Stewart, Cary Grant, Mickey Rooney, Lauren Bacall, Katharine Hepburn, and Frank Sinatra.   \n\nThousands walked past the coffin. One flower arrangement was shaped like a rainbow, recalling Ms. Garland's famous song, \"Over the Rainbow\" and the movie \"The Wizard of Oz.\" \n\nI was amazed at how many mourners there were. Police had to allow the line to pass through during the night. There was an overwhelming sense of sadness. Many people had to wait four hours to get inside and view the coffin. \n\nJudy Garland led a troubled life. I couldn't help thinking of lines from her greatest song – \n\n\"Somewhere, over the rainbow, bluebirds fly … And the dreams that you dare to –” \n\"Oh why, oh why can't I?\"\n\nShe was 47. And many New Yorkers regarded her as a treasure.","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1297645843617261","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.2765","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14-5","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14","rel":"parent"}],"id":"IAB14-5","label":"Senior Living"},{"score":"0.1260","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14","rel":"self"}],"id":"IAB14","label":"Society"}]},"postidString":"facebook_page.219296474785542_1297645843617261","postMeta":{"inserted":"content-engine"},"timestamp":1497289531,"sharesRcvd":19,"likesRcvd":30,"source":"facebook_page","lastUpdateQuantum":4995759,"name":"Gabe Pressman","imageLarge":"https://scontent.xx.fbcdn.net/v/t1.0-9/s720x720/19059941_1297645843617261_1809416921319358579_n.jpg?oh=3c9d8a1bbb2ade676b5148620057c6b6&oe=59A38329","objectID":"1297645843617261","repliesRcvd":9,"image":"https://scontent.xx.fbcdn.net/v/t1.0-0/s130x130/19059941_1297645843617261_1809416921319358579_n.jpg?oh=2449d0f7c0f57b93f992031699bb9572&oe=59D8A73C","username":"GabePressmanNBC","link":"https://www.facebook.com/GabePressmanNBC/photos/a.893019720746544.1073741827.219296474785542/1297645843617261/?type=3","timeQuantum":4990965,"title":"Timeline Photos","type":"photo"},{"content":"ANNE FRANK, TEENAGE POET OF THE HOLOCAUST, WHO WROTE OF BEAUTY AND HAPPINESS\n\nAnne Frank, a teenager destined to write a diary that would electrify the world, was born on June 12, 1929 in Frankfurt, Germany. Later, to escape the Nazis, her father moved the family to Holland. But, when the Germans occupied Holland and the Nazis threatened to send all Jewish people to concentration camps, Otto Frank and his family hid in an attic. They were supported by a group of friends who brought them food and other necessities. \n\nHer father, Otto, gave her a small autograph book on her 13th birthday. And she began to write. The thoughts she expressed were those of a young person on the cusp of womanhood. They reflected the terror of the Nazi-led persecution of Dutch Jews and yet the sweetness of Anne's perception of the wonderful things in the world.\n\nThus, she wrote: \"Think of all the beauty still left around you and be happy,\" and –\n\n\"How wonderful it is that nobody need wait a single moment before starting to improve the world,\" and –\n\n\"I’ve found that there is always some beauty left – in nature, sunshine, freedom, in yourself; these can all help you.\"      \n\nOutside their attic refuge, Jewish people had to wear yellow stars and, ultimately, were paraded into trains that took them to death camps. And yet Anne could tell her diary: \"Where there's hope, there's life. It fills us with fresh courage and makes us strong again.\"\n\nAnd she would also say: \"In spite of everything, I still believe that people are really good at heart.\"\n\nIt was before the era of feminism but Anne could somehow foresee the future controversy: \"Generally speaking, men are held in great esteem in all parts of the world, so why shouldn't women have their share? Soldiers and war heroes are honored and commemorated ... but how many people look upon women too as soldiers? ...Women, who struggle and suffer pain to ensure the continuation of the human race...\"\n\nFinally, Anne wrote: \"I don't want to have lived in vain like most people. I want to be useful or bring enjoyment to all people, even those I've never met. I want to go on living even after my death!\"\n\nAnne and her family were betrayed in August 1944 by a Dutch Nazi. \n\nThe whole family was shipped to Auschwitz. Ultimately, Anne died of typhus. Her father, Otto, was the only survivor and, in 1947, he published Anne's diary.\n\nAs she wrote: \"As long as this exists, this sunshine and this cloudless sky, and, as long as I can enjoy it, how can I be sad?\"","profileString":"facebook_page.219296474785542","postURL":"https://facebook.com/219296474785542/posts/1299390306776148","avatar":"https://graph.facebook.com/219296474785542/picture","classification":{"engine":"aylien","language":"en","taxonomy":[{"score":"0.3787","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB23-8","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB23","rel":"parent"}],"id":"IAB23-8","label":"Judaism"},{"score":"0.3712","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB6-6","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB6","rel":"parent"}],"id":"IAB6-6","label":"Parenting teens"},{"score":"0.2567","confident":false,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14-7","rel":"self"},{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14","rel":"parent"}],"id":"IAB14-7","label":"Weddings"},{"score":"0.1198","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB14","rel":"self"}],"id":"IAB14","label":"Society"},{"score":"0.1058","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB23","rel":"self"}],"id":"IAB23","label":"Religion & Spirituality"},{"score":"0.0960","confident":true,"links":[{"link":"https://api.aylien.com/api/v1/classify/taxonomy/iab-qag/IAB6","rel":"self"}],"id":"IAB6","label":"Family & Parenting"}]},"postidString":"facebook_page.219296474785542_1299390306776148","postMeta":{"inserted":"content-engine"},"timestamp":1497456254,"sharesRcvd":34,"likesRcvd":75,"source":"facebook_page","lastUpdateQuantum":4995759,"name":"Gabe Pressman","imageLarge":"https://scontent.xx.fbcdn.net/v/t1.0-9/19059208_1299390306776148_498690600578250169_n.jpg?oh=0b18088d856e32326eb2da84cfd3573d&oe=59DAD57C","objectID":"1299390306776148","repliesRcvd":19,"image":"https://scontent.xx.fbcdn.net/v/t1.0-0/s130x130/19059208_1299390306776148_498690600578250169_n.jpg?oh=cfee6d134180af4e3dbeb856d66d182f&oe=59DB11E1","username":"GabePressmanNBC","link":"https://www.facebook.com/GabePressmanNBC/photos/a.893019720746544.1073741827.219296474785542/1299390306776148/?type=3","timeQuantum":4991520,"title":"Timeline Photos","type":"photo"}]